In [3]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [7]:
df

                   A         B         C         D
2013-01-01  0.188704  1.070519 -1.070776  0.305288
2013-01-02 -0.267922  0.232727 -0.125958 -0.609242
2013-01-03 -1.211426 -0.350310 -0.484385 -0.006699
2013-01-04 -0.660126  0.121017  1.367126 -1.472510
2013-01-05  0.044740 -1.786649  1.151271  0.637740
2013-01-06  0.098909 -0.862351 -1.054246 -0.443922

In [8]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [12]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.to_numpy()

array([[ 0.18870391,  1.07051907, -1.0707756 ,  0.30528841],
       [-0.26792197,  0.23272676, -0.12595832, -0.60924174],
       [-1.21142636, -0.35030952, -0.48438523, -0.00669909],
       [-0.66012568,  0.12101745,  1.36712638, -1.47251004],
       [ 0.04474021, -1.78664928,  1.15127138,  0.6377404 ],
       [ 0.09890949, -0.86235124, -1.05424603, -0.44392241]])

In [15]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [16]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.301187 -0.262508 -0.036161 -0.264891
std    0.543731  0.985884  1.067249  0.750398
min   -1.211426 -1.786649 -1.070776 -1.472510
25%   -0.562075 -0.734341 -0.911781 -0.567912
50%   -0.111591 -0.114646 -0.305172 -0.225311
75%    0.085367  0.204799  0.831964  0.227292
max    0.188704  1.070519  1.367126  0.637740

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.188704   -0.267922   -1.211426   -0.660126    0.044740    0.098909
B    1.070519    0.232727   -0.350310    0.121017   -1.786649   -0.862351
C   -1.070776   -0.125958   -0.484385    1.367126    1.151271   -1.054246
D    0.305288   -0.609242   -0.006699   -1.472510    0.637740   -0.443922

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.305288 -1.070776  1.070519  0.188704
2013-01-02 -0.609242 -0.125958  0.232727 -0.267922
2013-01-03 -0.006699 -0.484385 -0.350310 -1.211426
2013-01-04 -1.472510  1.367126  0.121017 -0.660126
2013-01-05  0.637740  1.151271 -1.786649  0.044740
2013-01-06 -0.443922 -1.054246 -0.862351  0.098909

In [20]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-05  0.044740 -1.786649  1.151271  0.637740
2013-01-06  0.098909 -0.862351 -1.054246 -0.443922
2013-01-03 -1.211426 -0.350310 -0.484385 -0.006699
2013-01-04 -0.660126  0.121017  1.367126 -1.472510
2013-01-02 -0.267922  0.232727 -0.125958 -0.609242
2013-01-01  0.188704  1.070519 -1.070776  0.305288

In [21]:
df["A"]

2013-01-01    0.188704
2013-01-02   -0.267922
2013-01-03   -1.211426
2013-01-04   -0.660126
2013-01-05    0.044740
2013-01-06    0.098909
Freq: D, Name: A, dtype: float64

In [22]:
df[0:3]

                   A         B         C         D
2013-01-01  0.188704  1.070519 -1.070776  0.305288
2013-01-02 -0.267922  0.232727 -0.125958 -0.609242
2013-01-03 -1.211426 -0.350310 -0.484385 -0.006699

In [23]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.267922  0.232727 -0.125958 -0.609242
2013-01-03 -1.211426 -0.350310 -0.484385 -0.006699
2013-01-04 -0.660126  0.121017  1.367126 -1.472510

In [24]:
df.loc[dates[0]]

A    0.188704
B    1.070519
C   -1.070776
D    0.305288
Name: 2013-01-01 00:00:00, dtype: float64

In [25]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.188704  1.070519
2013-01-02 -0.267922  0.232727
2013-01-03 -1.211426 -0.350310
2013-01-04 -0.660126  0.121017
2013-01-05  0.044740 -1.786649
2013-01-06  0.098909 -0.862351

In [26]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.267922  0.232727
2013-01-03 -1.211426 -0.350310
2013-01-04 -0.660126  0.121017

In [27]:
df.loc[dates[0], "A"]

np.float64(0.18870391139808018)

In [28]:
df.iloc[3]

A   -0.660126
B    0.121017
C    1.367126
D   -1.472510
Name: 2013-01-04 00:00:00, dtype: float64

In [29]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.660126  0.121017
2013-01-05  0.044740 -1.786649

In [30]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.267922 -0.125958
2013-01-03 -1.211426 -0.484385
2013-01-05  0.044740  1.151271

In [31]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.070519 -1.070776
2013-01-02  0.232727 -0.125958
2013-01-03 -0.350310 -0.484385
2013-01-04  0.121017  1.367126
2013-01-05 -1.786649  1.151271
2013-01-06 -0.862351 -1.054246

In [32]:
df.iloc[1, 1]

np.float64(0.23272676067472117)

In [33]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.188704  1.070519 -1.070776  0.305288
2013-01-05  0.044740 -1.786649  1.151271  0.637740
2013-01-06  0.098909 -0.862351 -1.054246 -0.443922

In [34]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.188704  1.070519       NaN  0.305288
2013-01-02       NaN  0.232727       NaN       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04       NaN  0.121017  1.367126       NaN
2013-01-05  0.044740       NaN  1.151271  0.637740
2013-01-06  0.098909       NaN       NaN       NaN

In [35]:
df2 = df.copy()

In [37]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [38]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -1.211426 -0.350310 -0.484385 -0.006699   two
2013-01-05  0.044740 -1.786649  1.151271  0.637740  four

In [39]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [40]:
df["F"] = s1

In [41]:
df.at[dates[0], "A"] = 0

In [42]:
df.iat[0, 1] = 0

In [43]:
df.loc[:, "D"] = np.array([5] * len(df))

In [44]:
df2 = df.copy()

In [45]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [46]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [47]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.070776  5.0  NaN  1.0
2013-01-02 -0.267922  0.232727 -0.125958  5.0  1.0  1.0
2013-01-03 -1.211426 -0.350310 -0.484385  5.0  2.0  NaN
2013-01-04 -0.660126  0.121017  1.367126  5.0  3.0  NaN

In [48]:
df1.dropna(how="any")

                   A         B         C    D    F    E
2013-01-02 -0.267922  0.232727 -0.125958  5.0  1.0  1.0

In [49]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.070776  5.0  5.0  1.0
2013-01-02 -0.267922  0.232727 -0.125958  5.0  1.0  1.0
2013-01-03 -1.211426 -0.350310 -0.484385  5.0  2.0  5.0
2013-01-04 -0.660126  0.121017  1.367126  5.0  3.0  5.0

In [50]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [51]:
df.mean()

A   -0.332637
B   -0.440928
C   -0.036161
D    5.000000
F    3.000000
dtype: float64

In [52]:
df.mean(axis=1)

2013-01-01    0.982306
2013-01-02    1.167769
2013-01-03    0.990776
2013-01-04    1.765604
2013-01-05    1.681872
2013-01-06    1.636462
Freq: D, dtype: float64

In [53]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [54]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.211426 -1.350310 -1.484385  4.0  1.0
2013-01-04 -3.660126 -2.878983 -1.632874  2.0  0.0
2013-01-05 -4.955260 -6.786649 -3.848729  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [55]:
df.agg(lambda x: np.mean(x) * 5.6)

A    -1.862769
B    -2.469195
C    -0.202503
D    28.000000
F    16.800000
dtype: float64

In [56]:
df.transform(lambda x: x * 101.2)

                     A           B           C      D      F
2013-01-01    0.000000    0.000000 -108.362491  506.0    NaN
2013-01-02  -27.113703   23.551948  -12.746982  506.0  101.2
2013-01-03 -122.596348  -35.451324  -49.019785  506.0  202.4
2013-01-04  -66.804718   12.246966  138.353190  506.0  303.6
2013-01-05    4.527710 -180.808908  116.508663  506.0  404.8
2013-01-06   10.009640  -87.269945 -106.689698  506.0  506.0

In [57]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [58]:
s.value_counts()

1    5
4    2
6    1
0    1
3    1
Name: count, dtype: int64

In [59]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [60]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [61]:
df = pd.DataFrame(np.random.randn(10, 4))

In [62]:
df

          0         1         2         3
0 -0.014865 -0.634750  1.828827  2.063259
1  0.353604  0.010658  0.176863 -0.494047
2 -1.268124 -1.488994  0.532726  1.946107
3 -0.815881  0.509957  0.120360 -1.833289
4  0.826065 -1.110256 -1.421545  1.055677
5 -0.690992 -0.271259 -0.092302  1.633933
6 -0.597375  0.121711 -0.067340 -0.081476
7  1.988130 -0.388450 -0.378200 -1.091141
8 -0.304166  0.247525  0.064987 -1.576053
9  1.261797  0.454515  0.234283  0.829304

In [63]:
pieces = [df[:3], df[3:7], df[7:]]

In [64]:
pd.concat(pieces)

          0         1         2         3
0 -0.014865 -0.634750  1.828827  2.063259
1  0.353604  0.010658  0.176863 -0.494047
2 -1.268124 -1.488994  0.532726  1.946107
3 -0.815881  0.509957  0.120360 -1.833289
4  0.826065 -1.110256 -1.421545  1.055677
5 -0.690992 -0.271259 -0.092302  1.633933
6 -0.597375  0.121711 -0.067340 -0.081476
7  1.988130 -0.388450 -0.378200 -1.091141
8 -0.304166  0.247525  0.064987 -1.576053
9  1.261797  0.454515  0.234283  0.829304

In [65]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [66]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [67]:
left

   key  lval
0  foo     1
1  foo     2

In [68]:
right

   key  rval
0  foo     4
1  foo     5

In [69]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [70]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})

In [71]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

In [72]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [73]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [74]:
df

     A      B         C         D
0  foo    one -0.506961 -0.835111
1  bar    one  1.187771  0.143131
2  foo    two -0.205210 -0.341044
3  bar  three  1.265437  1.169269
4  foo    two -1.368370  0.901571
5  bar    two  0.590428 -1.922878
6  foo    one  1.045715 -0.771086
7  foo  three  0.424975 -0.268836

In [75]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  3.043636 -0.610479
foo -0.609851 -1.314507

In [76]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    1.187771  0.143131
    three  1.265437  1.169269
    two    0.590428 -1.922878
foo one    0.538754 -1.606197
    three  0.424975 -0.268836
    two   -1.573580  0.560527

In [1]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]

In [4]:
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

In [5]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [6]:
df2 = df[:4]

In [7]:
df2

                     A         B
first second
bar   one    -1.641758 -0.628894
      two    -0.626494 -0.134815
baz   one     1.601425  0.691264
      two    -0.094048  1.784072

In [8]:
stacked = df2.stack(future_stack=True)

In [9]:
stacked

first  second
bar    one     A   -1.641758
               B   -0.628894
       two     A   -0.626494
               B   -0.134815
baz    one     A    1.601425
               B    0.691264
       two     A   -0.094048
               B    1.784072
dtype: float64

In [10]:
stacked.unstack()

                     A         B
first second
bar   one    -1.641758 -0.628894
      two    -0.626494 -0.134815
baz   one     1.601425  0.691264
      two    -0.094048  1.784072

In [11]:
stacked.unstack(1)

second        one       two
first
bar   A -1.641758 -0.626494
      B -0.628894 -0.134815
baz   A  1.601425 -0.094048
      B  0.691264  1.784072

In [12]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.641758  1.601425
       B -0.628894  0.691264
two    A -0.626494 -0.094048
       B -0.134815  1.784072

In [13]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [14]:
df

        A  B    C         D         E
0     one  A  foo -1.434130  0.343580
1     one  B  foo  0.480325  2.199439
2     two  C  foo  0.664480 -1.444207
3   three  A  bar  0.174531 -1.224659
4     one  B  bar  0.091205  0.519005
5     one  C  bar -0.302438 -0.930202
6     two  A  foo  0.402576  0.339292
7   three  B  foo -0.111444 -0.104986
8     one  C  foo  1.389386 -0.358753
9     one  A  bar -0.381221 -1.473708
10    two  B  bar  2.726675 -0.325506
11  three  C  bar  0.167833  1.916292

In [15]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A -0.381221 -1.434130
      B  0.091205  0.480325
      C -0.302438  1.389386
three A  0.174531       NaN
      B       NaN -0.111444
      C  0.167833       NaN
two   A       NaN  0.402576
      B  2.726675       NaN
      C       NaN  0.664480

In [16]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")

In [17]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [18]:
ts.resample("5Min").sum()

2012-01-01    23189
Freq: 5min, dtype: int64

In [19]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")

In [20]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [21]:
ts

2012-03-06    0.831209
2012-03-07    0.336845
2012-03-08    0.203653
2012-03-09   -1.107316
2012-03-10   -0.602029
Freq: D, dtype: float64

In [22]:
ts_utc = ts.tz_localize("UTC")

In [23]:
ts_utc

2012-03-06 00:00:00+00:00    0.831209
2012-03-07 00:00:00+00:00    0.336845
2012-03-08 00:00:00+00:00    0.203653
2012-03-09 00:00:00+00:00   -1.107316
2012-03-10 00:00:00+00:00   -0.602029
Freq: D, dtype: float64

In [24]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00    0.831209
2012-03-06 19:00:00-05:00    0.336845
2012-03-07 19:00:00-05:00    0.203653
2012-03-08 19:00:00-05:00   -1.107316
2012-03-09 19:00:00-05:00   -0.602029
Freq: D, dtype: float64

In [25]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [26]:
rng + pd.offsets.BusinessDay(5)

DatetimeIndex(['2012-03-13', '2012-03-14', '2012-03-15', '2012-03-16',
               '2012-03-16'],
              dtype='datetime64[ns]', freq=None)